const bounds: Record<Lines, {
  start: string
  end: string
  express_pass: string[]
}[]> = {
  "1호선": [
    {
      start: "P177",
      end: "124",
      express_pass: [
        "P164", "P162", "P161", "P159", "P158", "P156", "P154", "P151", "P150", "P148", "P146", "P145"
      ]
    }
  ],
  "2호선": [],
  "3호선": [],
  "4호선": [],
  "5호선": [],
  "6호선": [],
  "7호선": [],
  "8호선": [],
  "9호선": [],
  "경강선": [],
  "경의중앙선": [],
  "경춘선": [],
  "공항철도": [],
  "김포골드라인": [],
  "서해선": [],
  "수인분당선": [],
  "신림선": [],
  "신분당선": [],
  "용인에버라인": [],
  "우이신설선": [],
  "의정부경전철": [],
  "인천2호선": [],
  "인천1호선": []
}

export default bounds